---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotUseAreaReinforcementHookTypeStyle
source: html/daae6855-eb87-5fdf-d0f3-a49904c9adc9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotUseAreaReinforcementHookTypeStyle Property

At least one of the bars in the Area Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUseAreaReinforcementHookTypeStyle { get; }
```